# Решение прогой возможно только при наличии начальной последовательности
comm = { # Переписывание таблицы
    (' ',0): (' ', -1, 1), # (столбец,строка): (на что заменить, куда пойти, в какое состояние перейти)
    (' ',1): (' ', 1, 2),
    (' ',3): (' ', 1, 4),
    (' ',4): (' ', 2, 4), # 2 - стоп (S)
    ('0',1): ('0', -1, 1),
    ('0',2): ('0', 1, 2),
    ('0',3): ('0', 1, 3),
    ('0',4): ('0', 1, 4),
    ('1',1): ('1', -1, 1),
    ('1',2): ('1', 1, 3),
    ('1',3): ('0', 1, 4),
    ('1',4): ('1', 1, 4),
}
def mt(s):
    s = list('       ' + s + ' ') # пустые клетки + последовательность + пустые клетки
    q = 0
    i = -1 # Индекс начального элемента
    while True:
        cmd = comm[(s[i], q)] # Из переписанного условия подтягиваем ячейку (столбец, строка)
        s[i] = cmd[0]
        if cmd[1] == 2: break # Прописываем, что 2 это стоп
        i += cmd[1] # Движение (куда пойти) из таблицы
        q = cmd[2] # Переход на новое состояние
    return ''.join(s) # Склеиваем список в строчку
x = bin(800)[2:] # Условие
print(int(mt(x), 2)) # Вывод результата в десятичной системе

'''comm = {
    (' ', 0): (' ', -1, 1),
    (' ', 1): (' ', 1, 2),
    (' ', 3): (' ', 1, 4),
    (' ', 4): (' ', 2, 4),
    ('0', 1): ('0', -1, 1),
    ('0', 2): ('0', 1, 2),
    ('0', 3): ('0', 1, 3),
    ('0', 4): ('0', 1, 4),
    ('1', 1): ('1', -1, 1),
    ('1', 2): ('1', 1, 3),
    ('1', 3): ('0', 1, 4),
    ('1', 4): ('1', 1, 4),
}
def mt(s):
    s = list(' ' + s + ' ')
    q = 0
    i = -1
    while True:
        cmd = comm[(s[i], q)]
        s[i] = cmd[0]
        if cmd[1] == 2: break
        i += cmd[1]
        q = cmd[2]
    return ''.join(s)
x = bin(800)[2:]
print(int(mt(x), 2))'''

'''comm = {
    (' ', 0): (' ',1,1),
    (' ', 1): ('0',1,2),
    ('0', 1): ('0',1,1),
    ('1', 1): ('1',1,1),
    (' ', 2): ('0',1,3),
    (' ', 3): (' ',2,3),
}

def mt(s):
    s = list(' ' + s + '          ')
    q = 0
    i = 0
    while True:
        cmd = comm[ (s[i] , q) ]
        s[i] = cmd[0]
        if cmd[1] == 2: break
        i += cmd[1]
        q = cmd[2]
    return ''.join(s)

x = bin(2028)[2:]
print(int(mt(x),2))
'''