'''s = 4**2015 + 2**2015 - 15 # Число, переписанное из условия
print(bin(s)[2:].count('1')) # Кол-во единиц
'''
'''s = abs(3 * 5**1984 - 7 * 25**777 - 11 * 125**666 - 404)
a = []
while s > 0:
    a.append(s % 5)
    s = s // 5
print(a.count(2))'''

'''a =[]
s = 4 * 3125**2019 + 3 * 625**2020 - 2 * 125**2021 + 25**2022 - 4 * 5**2023 - 2024
while s > 0:
    a.append(s % 25)
    s = s // 25'''

'''s = 7 * 512**120 - 6 * 64**100 + 8**210 - 255
print(oct(s)[2:].count('0'))'''

'''s = abs(6 * 343**1156 - 5 * 49**1147 + 4 * 7**1153 - 875)
a  = []
while s > 0:
    a.append(s % 7)
    s = s // 7
print(sum(a))'''

'''s = abs(5 * 343**2031 + 4 * 49**2142 - 3 * 7**111 + 7**222)
a =[]
while s > 0:
    a.append(s % 7)
    s = s//7
print(sum(a))
'''

'''s = abs(3 * 5**1984 - 7 * 25**777 - 11 * 125**666 - 404)
a = []
while s > 0:
    a.append(s % 5)
    s//=5
print(a.count(2))
'''

'''s = abs(5 * 1296**2021 - 4 * 216**2022 + 3 * 36 ** 2023 - 2 * 6**2024 - 2025)
a = 0
while s > 0:
    if (s % 36) % 2 == 0:
        a += 1
    s //= 36
print(a)'''

'''s = 64**13 + 32**6 - 16**2
print(bin(s)[2:].count('1'))'''

'''s = 4096**3125 - 512**625 + 64**125 - 8**25
print(oct(s)[2:].count('7'))'''

'''s = 1024**789 + 256**678 - 64**567
a = []
while s > 0:
    a.append(s % 5)
    s = s // 5
print(a.count(4))'''

'''s = 1296**625 * 216**125 + 36**25 - 6**5
a = []
while s > 0:
    a.append(s % 6)
    s = s // 6
print(a.count(5))'''

'''s = 16**16 + 8**8 + 32**4
print(bin(s)[2:].count('1'))'''

'''s = 4096**8 + 512**64 - 64**512
print(oct(s)[2:].count('7'))'''

'''s = 1234**1234+123**123-12**12
print(bin(s)[2:].count('1'))'''

'''s = 1111**111 + 111**11 - 11
print(bin(s)[2:].count('0'))'''

'''s = 234**123 + 32**12 - 32
a = []
while s > 0:
    a.append(s%4)
    s = s//4
print(a.count(3))'''

'''s = 125**27 * 625**81 + 25**9 - 5
a = []
while s > 0:
    a.append(s % 5)
    s = s // 5
print(a.count(4))'''

'''print(bin(4**3000+8**2000-2**12-256)[2:].count('1'))'''

'''print(bin(256**205+64**56-16**30)[2:].count('0'))'''

'''s = 343**31 + 49**19 - 6
a = []
while s > 0:
    a.append(s%7)
    s //= 7
print(a.count(6))'''

'''s = 2*2187**567 + 729**566 - 2*243**565 + 81**564 - 2 * 27**563 - 6561
a = []
while s > 0:
    if (s%27) % 2 == 0 and s%27 > 9:
        a.append(s%27)
    s //= 27
print(len(a))'''

'''s = 2 * 6144**2030 + 1536**2029 - 2*384**2028 + 96**2027 - 2*24**2026 - 2304
a = []
while s > 0:
    if s%324 <= 11:
        a.append(s%324)
    s //= 324
print(sum(a))'''

'''for x in range(1,2070):
    s = 7**230 + 7**130 + 7**30 - x
    a = []
    while s > 0:
        a.append(s%7)
        s //= 7
    if a.count(0) == 199:
        print(x)'''

'''for x in range(1,2030):
    s = 6**260 + 6**160 + 6**60 - x
    a = []
    while s > 0:
        a.append(s%6)
        s //= 6
    if a.count(0) == 202:
        print(x)'''

'''z = []
for x in range(1,3000):
    s = 5**127 + 5**27 - x
    a = []
    while s > 0:
        a.append(s%4)
        s //= 4
    z.append([a.count(0),x])
print(max(z))
for i in z:
    if i[0] == 32:
        print(i)'''

'''s = 8*343**2026 - 4*49**2025 + 2*7**2024 - 7**2023 - 2022
a = []
while s > 0:
    if (s%49) % 2 == 0:
        a.append(s%49)
    s //= 49
print(len(a))'''
